//==================================================
//  자료구조 ( Data Struct) 
//==================================================
//	-  프로그램을 작성하는데 필요한 데이터들이 메모리상에
//     저장되는 논리적 or 물리적 구조 
//	-  프로그램을 작성하는데 프로그램의 성격이나 효율을 위해
//	   데이타를 다양한 형태로 보관 저장 관리 
//   ex)  가구들...
//==================================================
// 자료구조 개론 
//==================================================
// 1)   선형 자료 구조 : 데이타를 단순히 1열로 나열한 형태의 구조 !! 
//	  -      배열 :  연속된 메모리 공간에 같은 타입의 데이타들의 집합 
//	  -연결리스트 :  데이타를 갖는 노드들을 연결시켜서 만드는 구조 !!
//	  - Queue (큐) :   선입선출(FIFO)먼저들어온 데이타가 먼저 나가는 구조 
//	  - Stack (스택) : 후입선출(LIFO) 마지막에 들어온 데이타가 먼저 가나는 구조 
// 2) 비선형 자료 구조 :  선형 자료구조 이외의 모든 자료구조  
//	  - Tree(트리,나무) : 계층적인 구조를 표현 !! 
//	  - graph(그라프)  :  복잡 다양한 구조 !! 
//==================================================
